Revit 2026 API

# UnitTypeId Properties

---

The UnitTypeId type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Acres | Acres. |
|  | Amperes | Amperes. |
|  | Atmospheres | Atmospheres. |
|  | Bars | Bars. |
|  | BritishThermalUnits | British thermal units. |
|  | BritishThermalUnitsPerDegreeFahrenheit | British thermal units per degree Fahrenheit. |
|  | BritishThermalUnitsPerHour | British thermal units per hour. |
|  | BritishThermalUnitsPerHourCubicFoot | British thermal units per hour cubic foot. |
|  | BritishThermalUnitsPerHourFootDegreeFahrenheit | British thermal units per hour foot degree Fahrenheit. |
|  | BritishThermalUnitsPerHourSquareFoot | British thermal units per hour square foot. |
|  | BritishThermalUnitsPerHourSquareFootDegreeFahrenheit | British thermal units per hour square foot degree Fahrenheit. |
|  | BritishThermalUnitsPerPound | British thermal units per pound. |
|  | BritishThermalUnitsPerPoundDegreeFahrenheit | British thermal units per pound degree Fahrenheit. |
|  | BritishThermalUnitsPerSecond | British thermal units per second. |
|  | BritishThermalUnitsPerSquareFootDegreeFahrenheit | British thermal units per square foot degree Fahrenheit. |
|  | Calories | Calories. |
|  | CaloriesPerSecond | Calories per second. |
|  | Candelas | Candelas. |
|  | CandelasPerSquareFoot | Candelas per square foot. |
|  | CandelasPerSquareMeter | Candelas per square meter. |
|  | Celsius | Celsius. |
|  | CelsiusInterval | Celsius interval. |
|  | Centimeters | Centimeters. |
|  | CentimetersPerMinute | Centimeters per minute. |
|  | CentimetersToTheFourthPower | Centimeters to the fourth power. |
|  | CentimetersToTheSixthPower | Centimeters to the sixth power. |
|  | Centipoises | Centipoises. |
|  | CubicCentimeters | Cubic centimeters. |
|  | CubicFeet | Cubic feet. |
|  | CubicFeetPerHour | Cubic feet per hour. |
|  | CubicFeetPerKip | Cubic feet per kip. |
|  | CubicFeetPerMinute | Cubic feet per minute. |
|  | CubicFeetPerMinuteCubicFoot | Cubic feet per minute cubic foot. |
|  | CubicFeetPerMinutePerBritishThermalUnitPerHour | Cubic feet per minute per British thermal unit per hour. |
|  | CubicFeetPerMinuteSquareFoot | Cubic feet per minute square foot. |
|  | CubicFeetPerMinuteTonOfRefrigeration | Cubic feet per minute ton of refrigeration. |
|  | CubicFeetPerPoundMass | Cubic feet per pound mass. |
|  | CubicInches | Cubic inches. |
|  | CubicMeters | Cubic meters. |
|  | CubicMetersPerHour | Cubic meters per hour. |
|  | CubicMetersPerHourCubicMeter | Cubic meters per hour cubic meter. |
|  | CubicMetersPerHourSquareMeter | Cubic meters per hour square meter. |
|  | CubicMetersPerKilogram | Cubic meters per kilogram. |
|  | CubicMetersPerKilonewton | Cubic meters per kilonewton. |
|  | CubicMetersPerSecond | Cubic meters per second. |
|  | CubicMetersPerWattSecond | Cubic meters per watt second. |
|  | CubicMillimeters | Cubic millimeters. |
|  | CubicYards | Cubic yards. |
|  | Currency | Currency. |
|  | CurrencyPerBritishThermalUnit | Cost per British thermal unit. |
|  | CurrencyPerBritishThermalUnitPerHour | Cost per British thermal unit per hour. |
|  | CurrencyPerSquareFoot | Cost per square foot. |
|  | CurrencyPerSquareMeter | Cost per square meter. |
|  | CurrencyPerWatt | Cost per watt. |
|  | CurrencyPerWattHour | Cost per watt hour. |
|  | Custom | Unrecognized custom unit. |
|  | CyclesPerSecond | Cycles per second. |
|  | Decimeters | Decimeters. |
|  | Degrees | Degrees. |
|  | DegreesMinutes | Degrees minutes seconds. |
|  | DekanewtonMeters | Dekanewton meters. |
|  | DekanewtonMetersPerMeter | Dekanewton meters per meter. |
|  | Dekanewtons | Dekanewtons. |
|  | DekanewtonsPerMeter | Dekanewtons per meter. |
|  | DekanewtonsPerSquareMeter | Dekanewtons per square meter. |
|  | Fahrenheit | Fahrenheit. |
|  | FahrenheitInterval | Fahrenheit interval. |
|  | Feet | Feet. |
|  | FeetFractionalInches | Feet and fractional inches. |
|  | FeetOfWater39_2DegreesFahrenheit | Feet of water (39.2 °F). |
|  | FeetOfWater39_2DegreesFahrenheitPer100Feet | Feet of water (39.2 °F) per 100 feet. |
|  | FeetPerKip | Feet per kip. |
|  | FeetPerMinute | Feet per minute. |
|  | FeetPerSecond | Feet per second. |
|  | FeetPerSecondSquared | Feet per second squared. |
|  | FeetToTheFourthPower | Feet to the fourth power. |
|  | FeetToTheSixthPower | Feet to the sixth power. |
|  | Fixed | Fixed. |
|  | Footcandles | Footcandles. |
|  | Footlamberts | Footlamberts. |
|  | FractionalInches | Fractional inches. |
|  | General | General. |
|  | Gigajoules | Gigajoules. |
|  | Gradians | Gradians. |
|  | GrainsPerHourSquareFootInchMercury | Grains per hour square foot inch mercury. |
|  | Hectares | Hectares. |
|  | Hertz | Hertz. |
|  | Horsepower | Horsepower. |
|  | Hours | Hours. |
|  | HourSquareFootDegreesFahrenheitPerBritishThermalUnit | Hour square foot degrees Fahrenheit per British thermal unit. |
|  | Inches | Inches. |
|  | InchesOfMercury32DegreesFahrenheit | Inches of mercury (32 °F). |
|  | InchesOfWater60DegreesFahrenheit | Inches of water (60 °F). |
|  | InchesOfWater60DegreesFahrenheitPer100Feet | Inches of water (60 °F) per 100 feet. |
|  | InchesPerSecondSquared | Inches per second squared. |
|  | InchesToTheFourthPower | Inches to the fourth power. |
|  | InchesToTheSixthPower | Inches to the sixth power. |
|  | InverseDegreesCelsius | Inverse degrees Celsius. |
|  | InverseDegreesFahrenheit | Inverse degrees Fahrenheit. |
|  | InverseKilonewtons | Inverse kilonewtons. |
|  | InverseKips | Inverse kips. |
|  | Joules | Joules. |
|  | JoulesPerGram | Joules per gram. |
|  | JoulesPerGramDegreeCelsius | Joules per gram degree Celsius. |
|  | JoulesPerKelvin | Joules per Kelvin. |
|  | JoulesPerKilogramDegreeCelsius | Joules per kilogram degree Celsius. |
|  | JoulesPerSquareMeterKelvin | Joules per square meter Kelvin. |
|  | Kelvin | Kelvin. |
|  | KelvinInterval | Kelvin interval. |
|  | Kiloamperes | Kiloamperes. |
|  | Kilocalories | Kilocalories. |
|  | KilocaloriesPerSecond | Kilocalories per second. |
|  | KilogramForceMeters | Kilogram force meters. |
|  | KilogramForceMetersPerMeter | Kilogram force meters per meter. |
|  | Kilograms | Kilograms. |
|  | KilogramsForce | Kilograms force. |
|  | KilogramsForcePerMeter | Kilograms force per meter. |
|  | KilogramsForcePerSquareMeter | Kilograms force per square meter. |
|  | KilogramsPerCubicMeter | Kilograms per cubic meter. |
|  | KilogramsPerHour | Kilograms per hour. |
|  | KilogramsPerKilogramKelvin | Kilograms per kilogram kelvin. |
|  | KilogramsPerMeter | Kilograms per meter. |
|  | KilogramsPerMeterHour | Kilograms per meter hour. |
|  | KilogramsPerMeterSecond | Kilograms per meter second. |
|  | KilogramsPerMinute | Kilograms per minute. |
|  | KilogramsPerSecond | Kilograms per second. |
|  | KilogramsPerSquareMeter | Kilograms per square meter. |
|  | Kilojoules | Kilojoules. |
|  | KilojoulesPerKelvin | Kilojoules per Kelvin. |
|  | KilojoulesPerSquareMeterKelvin | Kilojoules per square meter Kelvin. |
|  | KilometersPerHour | Kilometers per hour. |
|  | KilometersPerSecondSquared | Kilometers per second squared. |
|  | KilonewtonMeters | Kilonewton meters. |
|  | KilonewtonMetersPerDegree | Kilonewton meters per degree. |
|  | KilonewtonMetersPerDegreePerMeter | Kilonewton meters per degree per meter. |
|  | KilonewtonMetersPerMeter | Kilonewton meters per meter. |
|  | Kilonewtons | Kilonewtons. |
|  | KilonewtonsPerCubicMeter | Kilonewtons per cubic meter. |
|  | KilonewtonsPerMeter | Kilonewtons per meter. |
|  | KilonewtonsPerSquareCentimeter | Kilonewtons per square centimeter. |
|  | KilonewtonsPerSquareMeter | Kilonewtons per square meter. |
|  | KilonewtonsPerSquareMillimeter | Kilonewtons per square millimeter. |
|  | Kilopascals | Kilopascals. |
|  | KilovoltAmperes | Kilovolt amperes. |
|  | Kilovolts | Kilovolts. |
|  | KilowattHours | Kilowatt hours. |
|  | Kilowatts | Kilowatts. |
|  | KipFeet | Kip feet. |
|  | KipFeetPerDegree | Kip feet per degree. |
|  | KipFeetPerDegreePerFoot | Kip feet per degree per foot. |
|  | KipFeetPerFoot | Kip feet per foot. |
|  | Kips | Kips. |
|  | KipsPerCubicFoot | Kips per cubic foot. |
|  | KipsPerCubicInch | Kips per cubic inch. |
|  | KipsPerFoot | Kips per foot. |
|  | KipsPerInch | Kips per inch. |
|  | KipsPerSquareFoot | Kips per square foot. |
|  | KipsPerSquareInch | Kips per square inch. |
|  | Liters | Liters. |
|  | LitersPerHour | Liters per hour. |
|  | LitersPerMinute | Liters per minute. |
|  | LitersPerSecond | Liters per second. |
|  | LitersPerSecondCubicMeter | Liters per second cubic meter. |
|  | LitersPerSecondKilowatt | Liters per second kilowatt. |
|  | LitersPerSecondSquareMeter | Liters per second square meter. |
|  | Lumens | Lumens. |
|  | LumensPerWatt | Lumens per watt. |
|  | Lux | Lux. |
|  | Megajoules | Megajoules. |
|  | MeganewtonMeters | Meganewton meters. |
|  | MeganewtonMetersPerMeter | Meganewton meters per meter. |
|  | Meganewtons | Meganewtons. |
|  | MeganewtonsPerMeter | Meganewtons per meter. |
|  | MeganewtonsPerSquareMeter | Meganewtons per square meter. |
|  | Megapascals | Megapascals. |
|  | Megawatts | Megawatts. |
|  | Meters | Meters. |
|  | MetersCentimeters | Meters and centimeters. |
|  | MetersOfWaterColumn | Meters of water column. |
|  | MetersOfWaterColumnPerMeter | Meters of water column per meter. |
|  | MetersPerKilonewton | Meters per kilonewton. |
|  | MetersPerSecond | Meters per second. |
|  | MetersPerSecondSquared | Meters per second squared. |
|  | MetersToTheFourthPower | Meters to the fourth power. |
|  | MetersToTheSixthPower | Meters to the sixth power. |
|  | MicroinchesPerInchDegreeFahrenheit | Microinches per inch degree Fahrenheit. |
|  | MicrometersPerMeterDegreeCelsius | Micrometers per meter degree Celsius. |
|  | MilesPerHour | Miles per hour. |
|  | MilesPerSecondSquared | Miles per second squared. |
|  | Milliamperes | Milliamperes. |
|  | Millimeters | Millimeters. |
|  | MillimetersOfMercury | Millimeters of mercury. |
|  | MillimetersOfWaterColumn | Millimeters of water column. |
|  | MillimetersOfWaterColumnPerMeter | Millimeters of water column per meter. |
|  | MillimetersToTheFourthPower | Millimeters to the fourth power. |
|  | MillimetersToTheSixthPower | Millimeters to the sixth power. |
|  | MillionBritishThermalUnits | Million British thermal units. |
|  | Milliseconds | Milliseconds. |
|  | Millivolts | Millivolts. |
|  | Minutes | Minutes. |
|  | NanogramsPerPascalSecondSquareMeter | Nanograms per pascal second square meter. |
|  | NewtonMeters | Newton meters. |
|  | NewtonMetersPerMeter | Newton meters per meter. |
|  | Newtons | Newtons. |
|  | NewtonSecondsPerSquareMeter | Newton seconds per square meter. |
|  | NewtonsPerMeter | Newtons per meter. |
|  | NewtonsPerSquareMeter | Newtons per square meter. |
|  | NewtonsPerSquareMillimeter | Newtons per square millimeter. |
|  | OhmMeters | Ohm meters. |
|  | OneToRatio | 1 : Ratio. |
|  | Pascals | Pascals. |
|  | PascalSeconds | Pascal seconds. |
|  | PascalsPerMeter | Pascals per meter. |
|  | Percentage | Percentage. |
|  | PerMille | Per mille. |
|  | Pi | Multiples of π. |
|  | PoundForceFeet | Pound force feet. |
|  | PoundForceFeetPerFoot | Pound force feet per foot. |
|  | PoundForceSecondsPerSquareFoot | Pound force seconds per square foot. |
|  | PoundsForce | Pounds force. |
|  | PoundsForcePerCubicFoot | Pounds force per cubic foot. |
|  | PoundsForcePerFoot | Pounds force per foot. |
|  | PoundsForcePerSquareFoot | Pounds force per square foot. |
|  | PoundsForcePerSquareInch | Pounds force per square inch. |
|  | PoundsMass | Pounds mass. |
|  | PoundsMassPerCubicFoot | Pounds mass per cubic foot. |
|  | PoundsMassPerCubicInch | Pounds mass per cubic inch. |
|  | PoundsMassPerFoot | Pounds mass per foot. |
|  | PoundsMassPerFootHour | Pounds mass per foot hour. |
|  | PoundsMassPerFootSecond | Pounds mass per foot second. |
|  | PoundsMassPerHour | Pounds mass per hour. |
|  | PoundsMassPerMinute | Pounds mass per minute. |
|  | PoundsMassPerPoundDegreeFahrenheit | Pounds mass per pound degree Fahrenheit. |
|  | PoundsMassPerSecond | Pounds mass per second. |
|  | PoundsMassPerSquareFoot | Pounds mass per square foot. |
|  | Radians | Radians. |
|  | RadiansPerSecond | Radians per second. |
|  | Rankine | Rankine. |
|  | RankineInterval | Rankine interval. |
|  | RatioTo1 | Ratio : 1. |
|  | RatioTo10 | Ratio : 10. |
|  | RatioTo12 | Ratio : 12. |
|  | RevolutionsPerMinute | Revolutions per minute. |
|  | RevolutionsPerSecond | Revolutions per second. |
|  | RiseDividedBy1000Millimeters | Rise / 1000 millimeters. |
|  | RiseDividedBy10Feet | Rise / 10 feet. |
|  | RiseDividedBy120Inches | Rise / 120 inches. |
|  | RiseDividedBy12Inches | Rise / 12 inches. |
|  | RiseDividedBy1Foot | Rise / 1 foot. |
|  | Seconds | Seconds. |
|  | Shaku | Shaku. |
|  | SlopeDegrees | Degrees. |
|  | SquareCentimeters | Square centimeters. |
|  | SquareCentimetersPerMeter | Square centimeters per meter. |
|  | SquareFeet | Square feet. |
|  | SquareFeetPer1000BritishThermalUnitsPerHour | Square feet per thousand British thermal units per hour. |
|  | SquareFeetPerFoot | Square feet per foot. |
|  | SquareFeetPerKip | Square feet per kip. |
|  | SquareFeetPerSecond | Square feet per second. |
|  | SquareFeetPerTonOfRefrigeration | Square feet per ton of refrigeration. |
|  | SquareInches | Square inches. |
|  | SquareInchesPerFoot | Square inches per foot. |
|  | SquareMeterKelvinsPerWatt | Square meter kelvins per watt. |
|  | SquareMeters | Square meters. |
|  | SquareMetersPerKilonewton | Square meters per kilonewton. |
|  | SquareMetersPerKilowatt | Square meters per kilowatt. |
|  | SquareMetersPerMeter | Square meters per meter. |
|  | SquareMetersPerSecond | Square meters per second. |
|  | SquareMillimeters | Square millimeters. |
|  | SquareMillimetersPerMeter | Square millimeters per meter. |
|  | StationingFeet | Feet. |
|  | StationingMeters | Meters. |
|  | StationingSurveyFeet | US survey feet. |
|  | Steradians | Steradians. |
|  | Therms | Therms. |
|  | ThousandBritishThermalUnits | Thousand British thermal units. |
|  | ThousandBritishThermalUnitsPerHour | Thousand British thermal units per hour. |
|  | TonneForceMeters | Tonne force meters. |
|  | TonneForceMetersPerMeter | Tonne force meters per meter. |
|  | Tonnes | Tonnes. |
|  | TonnesForce | Tonnes force. |
|  | TonnesForcePerMeter | Tonnes force per meter. |
|  | TonnesForcePerSquareMeter | Tonnes force per square meter. |
|  | TonsOfRefrigeration | Tons of refrigeration. |
|  | UsGallons | US gallons. |
|  | UsGallonsPerHour | US gallons per hour. |
|  | UsGallonsPerMinute | US gallons per minute. |
|  | UsSurveyFeet | US survey feet. |
|  | UsTonnesForce | US tonnes force. |
|  | UsTonnesMass | US tonnes mass. |
|  | VoltAmperes | Volt amperes. |
|  | VoltAmperesPerSquareFoot | Volt amperes per square foot. |
|  | VoltAmperesPerSquareMeter | Volt amperes per square meter. |
|  | Volts | Volts. |
|  | Watts | Watts. |
|  | WattsPerCubicFoot | Watts per cubic foot. |
|  | WattsPerCubicFootPerMinute | Watts per cubic foot per minute. |
|  | WattsPerCubicMeter | Watts per cubic meter. |
|  | WattsPerCubicMeterPerSecond | Watts per cubic meter per second. |
|  | WattsPerFoot | Watts per foot. |
|  | WattsPerMeter | Watts per meter. |
|  | WattsPerMeterKelvin | Watts per meter kelvin. |
|  | WattsPerSquareFoot | Watts per square foot. |
|  | WattsPerSquareMeter | Watts per square meter. |
|  | WattsPerSquareMeterKelvin | Watts per square meter kelvin. |

#### Reference

UnitTypeId Class

Autodesk.Revit.DB Namespace